---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.ForwardIterator
source: html/ece41a55-5992-e36a-5f5b-043a4065e9ec.htm
---
# Autodesk.Revit.DB.DoubleArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual DoubleArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.